nebkat/flutter-bluebird/tools/esp32_peripheral/sdkconfig.defaults
# Bluebird BLE peripheral test fixture — ESP32-S3 + NimBLE (Bluedroid disabled)
CONFIG_IDF_TARGET="esp32s3"

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# Persist bonds/CCCDs in NVS so bonding survives reboots
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Security: LE Secure Connections (Just Works pairing is configured in code)
CONFIG_BT_NIMBLE_SM_SC=y

# Preferred / maximum ATT MTU
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
